app/controllers/cars_controller.rb

SELECT "cars".* FROM "cars" WHERE "cars"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
  def show
    @q = Car.ransack(params[:q]) # adding Search funtionality using ransack gem
    @car = @q.result # display cars by results
    @car = Car.find(params[:id])